# Neo4J学习

## 1.入门简介

### 1.1简介

> ​	Neo4j是一个高性能的,NOSQL图形数据库，它将结构化数据存储在网络上而不是表中。它是一个嵌入的、基于磁盘的、具备完全的事务特性的Java持久化引擎，但是它将结构化数据存储在网络(从数学角度叫做图)上而不是表中。Neo4j也可以被看作是一个高性能的图引擎，该引擎具有成熟数据库的所有特性。程序员工作在一个面向对象的、灵活的网络结构下而不是严格、静态的表中——但是他们可以享受到具备完全的事务特性、企业级的数据库的所有好处。
>
> ​	Neo4j因其嵌入式、高性能、轻量级等优势，越来越受到关注.

### 1.2Neo4j的特点

- SQL就像简单的查询语言Neo4j CQL
- 它遵循属性图数据模型
- 它通过使用Apache Lucence支持索引
- 它支持UNIQUE约束
- 它包含一个用于执行CQL命令的UI：Neo4j数据浏览器
- 它支持完整的ACID（原子性，一致性，隔离性和持久性）规则
- 它采用原生图形库与本地GPE（图形处理引擎）
- 它支持查询的数据导出到JSON和XLS格式
- 它提供了REST API，可以被任何编程语言（如Java，Spring，Scala等）访问
- 它提供了可以通过任何UI MVC框架（如Node JS）访问的Java脚本
- 它支持两种Java API：Cypher API和Native Java API来开发Java应用程序

### 1.3Neo4j的优点

- 它很容易表示连接的数据
- 检索/遍历/导航更多的连接数据是非常容易和快速的
- 它非常容易地表示半结构化数据
- Neo4j CQL查询语言命令是人性化的可读格式，非常容易学习
- 使用简单而强大的数据模型
- 它不需要复杂的连接来检索连接的/相关的数据，因为它很容易检索它的相邻节点或关系细节没有连接或索引

### 1.5Neo4j的缺点或限制

- AS的Neo4j 2.1.3最新版本，它具有支持节点数，关系和属性的限制。
- 它不支持Sharding。

## 2.Neo4j属性图数据模型

Neo4j图数据库遵循属性图模型来存储和管理其数据。

属性图模型规则

- 表示节点，关系和属性中的数据
- 节点和关系都包含属性
- 关系连接节点
- 属性是键值对
- 节点用圆圈表示，关系用方向键表示。
- 关系具有方向：单向和双向。
- 每个关系包含“开始节点”或“从节点”和“到节点”或“结束节点”

## 3.neo4j在Ubuntu上Docker的安装

### 3.1安装到Docker上

```bash
docker run --name neo4j -p 7474:7474 -p 7687:7687  -d  -v /neo4j/data:/data    neo4j:latest
```

### 3.2访问：http://121.89.208.222:7474/

![image-20201127234756940](E:\新技术学习\java_study\Neo4j学习\images\image-20201127234756940.png)

### 3.3Neo4j - 构建模块



#### 3.3.1节点

节点是图表的基本单位。 它包含具有键值对的属性，如下所示

![image-20201127234914803](E:\新技术学习\java_study\Neo4j学习\images\image-20201127234914803.png)

这里Node Name =“Employee”，它包含一组属性作为键值对。



#### 3.3.2属性

属性是用于描述图节点和关系的键值对

**Key = 值**

其中Key是一个字符串

值可以通过使用任何Neo4j数据类型来表示

#### 3.3.3关系

关系是图形数据库的另一个主要构建块。 它连接两个节点，如下所示。

![image-20201127235046483](E:\新技术学习\java_study\Neo4j学习\images\image-20201127235046483.png)

这里Emp和Dept是两个不同的节点。 “WORKS_FOR”是Emp和Dept节点之间的关系。因为它表示从Emp到Dept的箭头标记，那么这种关系描述的一样Emp WORKS_FOR Dept每个关系包含一个起始节点和一个结束节点。这里“Emp”是一个起始节点。“Dept”是端节点。由于该关系箭头标记表示从“Emp”节点到“Dept”节点的关系，该关系被称为“进入关系”到“Dept”节点。并且“外向关系”到“Emp”节点。像节点一样，关系也可以包含属性作为键值对。

![image-20201127235121444](E:\新技术学习\java_study\Neo4j学习\images\image-20201127235121444.png)



这里的“WORKS_FOR”关系有一个属性作为键值对ID = 123它代表了这种关系的一个ID。



#### 3.3.4标签

​	Label将一个公共名称与一组节点或关系相关联。 节点或关系可以包含一个或多个标签。 我们可以为现有节点或关系创建新标签。 我们可以从现有节点或关系中删除现有标签。

从前面的图中，我们可以观察到有两个节点。

左侧节点都有一个标签：“EMP”，而右侧节点都有一个标签：“Dept”。

这两个节点之间的关系，也有一个标签：“WORKS_FOR”

**注： -**Neo4j将数据存储在节点或关系的属性中。

#### 3.3.5数据浏览器

一旦我们安装Neo4j，我们可以访问Neo4j数据浏览器使用以下URL

http：// ip：7474 / browser /

![Neo4j数据浏览器](E:\新技术学习\java_study\Neo4j学习\images\201612260916443762.png)

Neo4j数据浏览器用于执行CQL命令并查看输出输出。这里我们需要在美元提示符处执行所有CQL命令：“$”

在美元符号后键入命令，然后单击“执行”按钮运行命令。它与Neo4j数据库服务器交互，检索和显示下面的结果到那个美元提示。使用“UI视图”按钮以图形格式查看结果。 上图以“UI视图”格式显示结果。使用“网格视图”按钮在网格视图中查看结果。 下图在“网格视图”格式中显示相同的结果。

![网格视图](E:\新技术学习\java_study\Neo4j学习\images\201612260918064546.png)

当我们使用“网格视图”查看我们的查询结果时，我们可以将它们导出为两种不同格式的文件。

## 4Neo4j CQL 命令

### 4.1Neo4j使用CQL“CREATE”命令

①创建没有属性的节点

②使用属性创建节点

③在没有属性的节点之间创建关系

④使用属性创建节点之间的关系

⑤为节点或关系创建单个或多个标签

#### 4.1.1Neo4j CQL创建一个没有属性的节点

Neo4j CQL“CREATE”命令用于创建没有属性的节点。 它只是创建一个没有任何数据的节点。

##### CREATE命令语法

```bash
CREATE (<node-name>:<label-name>)
```

语法说明

| 语法元素     | 描述                       |
| ------------ | -------------------------- |
| CREATE       | 它是一个Neo4j CQL命令。    |
| <node-name>  | 它是我们要创建的节点名称。 |
| <label-name> | 它是一个节点标签名称       |

**注意事项 -**

1、Neo4j数据库服务器使用此<node-name>将此节点详细信息存储在Database.As中作为Neo4j DBA或Developer，我们不能使用它来访问节点详细信息。

2、Neo4j数据库服务器创建一个<label-name>作为内部节点名称的别名。作为Neo4j DBA或Developer，我们应该使用此标签名称来访问节点详细信息。

例子：

```bash
CREATE (dept:Dept)
```



#### 4.1.2Neo4j CQL创建具有属性的节点

Neo4j CQL“CREATE”命令用于创建带有属性的节点。 它创建一个具有一些属性（键值对）的节点来存储数据。

##### CREATE命令语法： 

```bash
CREATE (
   <node-name>:<label-name>
   { 	
      <Property1-name>:<Property1-Value>
      ........
      <Propertyn-name>:<Propertyn-Value>
   }
)
```



语法说明：

| 语法元素                              | 描述                                            |
| ------------------------------------- | ----------------------------------------------- |
| <node-name>                           | 它是我们将要创建的节点名称。                    |
| <label-name>                          | 它是一个节点标签名称                            |
| <Property1-name>...<Propertyn-name>   | 属性是键值对。 定义将分配给创建节点的属性的名称 |
| <Property1-value>...<Propertyn-value> | 属性是键值对。 定义将分配给创建节点的属性的值   |

例子：

```bash
CREATE (dept:Dept { deptno:10,dname:"Accounting",location:"Hyderabad" })
```

**这里的属性名称是deptno，dname，location**

**属性值为10，"Accounting","Hyderabad"**

**正如我们讨论的，属性一个名称 - 值对。**

**Property = deptno:10**

**因为deptno是一个整数属性，所以我们没有使用单引号或双引号定义其值10。**

**由于dname和location是String类型属性，因此我们使用单引号或双引号定义其值10。**

**注意 - 要定义字符串类型属性值，我们需要使用单引号或双引号。**

### 4.2Neo4j CQL - MATCH命令

Neo4j CQL MATCH命令用于 - 

①从数据库获取有关节点和属性的数据

②从数据库获取有关节点，关系和属性的数据

##### MATCH命令语法：

```
MATCH 
(
   <node-name>:<label-name>
)
```



语法说明

| 语法元素     | 描述                         |
| ------------ | ---------------------------- |
| <node-name>  | 这是我们要创建一个节点名称。 |
| <label-name> | 这是一个节点的标签名称       |

注意事项 -

- Neo4j数据库服务器使用此<node-name>将此节点详细信息存储在Database.As中作为Neo4j DBA或Developer，我们不能使用它来访问节点详细信息。
- Neo4j数据库服务器创建一个<label-name>作为内部节点名称的别名。作为Neo4j DBA或Developer，我们应该使用此标签名称来访问节点详细信息。

**注意-**我们不能单独使用MATCH Command从数据库检索数据。 如果我们单独使用它，那么我们将InvalidSyntax错误。

#### 例如：

这个例子演示了“如果我们单独使用MATCH命令从数据库检索数据会发生什么”。 按照下面给出的步骤 - 

**步骤1** -打开Neo4j的数据浏览器。

**步骤2** -在数据浏览器的dollar提示符处键入以下命令。

```
MATCH (dept:Dept)
```

这里 -

- dept是节点名称
- Dept是emp节点的标签名称

![image-20201128113056991](E:\新技术学习\java_study\Neo4j学习\images\image-20201128113056991.png)

数据浏览器中看到的是错误的消息。如果你观察到错误消息，它告诉我们，MATCH 经常需要与其他的语句配合才可以使用.

如：match (n) return n



```
# 查询Dept下的内容
MATCH (dept:Dept) return dept
```

![image-20201128113446727](E:\新技术学习\java_study\Neo4j学习\images\image-20201128113446727.png)

### 4.3Neo4j CQL - RETURN子句

Neo4j CQL RETURN子句用于 -

①检索节点的某些属性

②检索节点的所有属性

③检索节点和关联关系的某些属性

④检索节点和关联关系的所有属性

##### RETURN命令语法：

```
RETURN 
   <node-name>.<property1-name>,
   ........
   <node-name>.<propertyn-name>
```



语法说明:

| 语法元素                            | 描述                                                         |
| ----------------------------------- | ------------------------------------------------------------ |
| <node-name>                         | 它是我们将要创建的节点名称。                                 |
| <Property1-name>...<Propertyn-name> | 属性是键值对。 <Property-name>定义要分配给创建节点的属性的名称 |

##### 例如：

本示例演示了“如果我们单独使用RETURN命令从数据库检索数据，会发生什么”。 按照下面给出的步骤 - 

**步骤1** -打开Neo4j的数据浏览器。



**步骤2** -在数据浏览器的dollar提示符处键入以下命令。

```
RETURN dept.deptno
```



这里 -

- dept是节点名称
- deptno是dept节点的属性名称

![image-20201128131614470](E:\新技术学习\java_study\Neo4j学习\images\image-20201128131614470.png)

发现该错误消息，它告诉我们，我们不能单独使用RETURN子句。我们应该既MATCH使用或CREATE命令。

### 4.4Neo4j CQL - MATCH & RETURN匹配和返回

在Neo4j CQL中，我们不能单独使用MATCH或RETURN命令，因此我们应该合并这两个命令以从数据库检索数据。Neo4j使用CQL MATCH + RETURN命令 - 

①检索节点的某些属性

②检索节点的所有属性

③检索节点和关联关系的某些属性

④检索节点和关联关系的所有属性

#### 4.4.1MATCH RETURN命令语法：

```
MATCH Command
RETURN Command
```

语法说明：

| 语法元素   | 描述                       |
| ---------- | -------------------------- |
| MATCH命令  | 这是Neo4j CQL MATCH命令。  |
| RETURN命令 | 这是Neo4j CQL RETURN命令。 |

##  

#### 4.4.2MATCH命令语法：

```
MATCH 
(
   <node-name>:<label-name>
)
```



语法说明：

| 语法元素     | 描述                         |
| ------------ | ---------------------------- |
| <node-name>  | 它是我们将要创建的节点名称。 |
| <label-name> | 它是一个节点标签名称         |



要点 -

- Neo4j数据库服务器使用此<node-name>将此节点详细信息存储在Database.As中作为Neo4j DBA或Developer，我们不能使用它来访问节点详细信息。
- Neo4j数据库服务器创建一个<label-name>作为内部节点名称的别名。作为Neo4j DBA或Developer，我们应该使用此标签名称来访问节点详细信息。

## 

#### 4.4.3RETURN命令语法：

```
RETURN 
   <node-name>.<property1-name>,
   ...
   <node-name>.<propertyn-name>
```



语法说明：

| 语法元素                            | 描述                                            |
| ----------------------------------- | ----------------------------------------------- |
| <node-name>                         | 它是我们将要创建的节点名称。                    |
| <Property1-name>...<Propertyn-name> | 属性是键值对。 定义将分配给创建节点的属性的名称 |



##### 例如：

本示例演示如何从数据库检索Dept节点的一些属性（deptno，dname）数据。**注-**结点包含3个属性：deptno，dname，location。 然而在这个例子中，我们感兴趣的是只查看两个属性数据。 按照下面给出的步骤 - 

**步骤1** -打开Neo4j的数据浏览器。

**步骤2** -在数据浏览器中的dollar提示符下键入以下命令。

```
MATCH (dept: Dept)
RETURN dept.deptNo,dept.dName
```

这里 -

- dept是节点名称
- 这里Dept是一个节点标签名
- deptno是dept节点的属性名称
- dname是dept节点的属性名

![image-20201128132137637](E:\新技术学习\java_study\Neo4j学习\images\image-20201128132137637.png)

## 5.Neo4j图数据库遵循属性图模型来存储和管理其数据。

### 5.1特点

根据属性图模型，关系应该是定向的。 否则，Neo4j将抛出一个错误消息。

#### 5.1.1基于方向性，Neo4j关系被分为两种主要类型。

①单向关系

②双向关系

#### 5.1.2在以下场景中，我们可以使用Neo4j CQL CREATE命令来创建两个节点之间的关系。 这些情况适用于Uni和双向关系。

①在两个现有节点之间创建无属性的关系

②在两个现有节点之间创建与属性的关系

③在两个新节点之间创建无属性的关系

④在两个新节点之间创建与属性的关系

⑤在具有WHERE子句的两个退出节点之间创建/不使用属性的关系

### 5.2Neo4j CQL - CREATE创建标签

#### 5.2.1Label是Neo4j数据库中的节点或关系的名称或标识符。

我们可以将此标签名称称为关系为“关系类型”。我们可以使用CQL CREATE命令为节点或关系创建单个标签，并为节点创建多个标签。 这意味着Neo4j仅支持两个节点之间的单个关系类型。我们可以在UI模式和网格模式下在CQL数据浏览器中观察此节点或关系的标签名称。 并且我们引用它执行CQL命令。到目前为止，我们只创建了一个节点或关系的标签，但我们没有讨论它的语法。

使用Neo4j CQL CREATE命令：

①为节点创建单个标签。

②为节点创建多个标签。

③为关系创建单个标签。

#### 5.2.2单个标签到节点

语法：

```
CREATE (<node-name>:<label-name>)
```

| S.No. | 语法元素               | 描述                      |
| ----- | ---------------------- | ------------------------- |
| 1     | CREATE 创建            | 它是一个Neo4j CQL关键字。 |
| 2     | <node-name> <节点名称> | 它是一个节点的名称。      |
| 3     | <label-name><标签名称> | 这是一个节点的标签名称。  |

##### **注意 -**

- 我们应该使用colon（:)运算符来分隔节点名和标签名。
- Neo4j数据库服务器使用此名称将此节点详细信息存储在Database.As Neo4j DBA或Developer中，我们不能使用它来访问节点详细信息
- Neo4j数据库服务器创建一个标签名称作为内部节点名称的别名。作为Neo4j DBA或开发人员，我们应该使用此标签名称来访问节点详细信息。

##### 例子：

```
CREATE (google1:GooglePlusProfile)
```

![image-20201128140154729](E:\新技术学习\java_study\Neo4j学习\images\image-20201128140154729.png)

#### 5.2.3多个标签到节点

语法：

```
CREATE (<node-name>:<label-name1>:<label-name2>.....:<label-namen>)
```

| S.No. | 语法元素                                         | 描述                           |
| ----- | ------------------------------------------------ | ------------------------------ |
| 1。   | CREATE 创建                                      | 这是一个Neo4j CQL关键字。      |
| 2。   | <node-name> <节点名称>                           | 它是一个节点的名称。           |
| 3。   | <label-name1>,<label-name2> <标签名1>，<标签名2> | 它是一个节点的标签名称的列表。 |

**注意 -**

- 我们应该使用colon（:)运算符来分隔节点名和标签名。
- 我们应该使用colon（:)运算符将一个标签名称分隔到另一个标签名称。

##### 例如：

本示例演示如何为“Cinema”节点创建多个标签名称。

我们的客户提供的多个标签名称：Cinema,Film,Movie,Picture。

```
CREATE (m:Movie:Cinema:Film:Picture)
```

这里m是一个节点名

Movie, Cinema, Film, Picture是m节点的多个标签名称

![image-20201128140416825](E:\新技术学习\java_study\Neo4j学习\images\image-20201128140416825.png)

#### 5.2.4单个标签到关系 

##### 语法：

```bash
CREATE (<node1-name>:<label1-name>)-
	[(<relationship-name>:<relationship-label-name>)]
	->(<node2-name>:<label2-name>)
```

##  

##### 语法说明

| S.No. | 语法元素                                 | 描述                      |
| ----- | ---------------------------------------- | ------------------------- |
| 1     | CREATE 创建                              | 它是一个Neo4J CQL关键字。 |
| 2     | <node1-name> <节点1名>                   | 它是From节点的名称。      |
| 3     | <node2-name> <节点2名>                   | 它是To节点的名称。        |
| 4     | <label1-name> <LABEL1名称>               | 它是From节点的标签名称    |
| 5     | <label2-name> <LABEL2名称>               | 它是To节点的标签名称。    |
| 6     | <relationship-name> <关系名称>           | 它是一个关系的名称。      |
| 7     | <relationship-label-name> <相关标签名称> | 它是一个关系的标签名称。  |

**注意 -**

- 我我们应该使用colon（:)运算符来分隔节点名和标签名。
- 我们应该使用colon（:)运算符来分隔关系名称和关系标签名称。
- 我们应该使用colon（:)运算符将一个标签名称分隔到另一个标签名称。
- Neo4J数据库服务器使用此名称将此节点详细信息存储在Database.As中作为Neo4J DBA或开发人员，我们不能使用它来访问节点详细信息。
- Neo4J Database Server创建一个标签名称作为内部节点名称的别名。作为Neo4J DBA或Developer，我们应该使用此标签名称来访问节点详细信息。

##### 例如：

```
CREATE (p1:Profile1)-[r1:LIKES]->(p2:Profile2)
```

这里p1和profile1是节点名称和节点标签名称“From Node”

p2和Profile2是“To Node”的节点名称和节点标签名称

r1是关系名称

LIKES是一个关系标签名称

![image-20201128140602570](E:\新技术学习\java_study\Neo4j学习\images\image-20201128140602570.png)